source ~/.bashrc
export PATH="$PATH:~/bin"
. "$HOME/.cargo/env"



##############################################################################
# 2022/04/25追加( ~/.scriptとその配下のディレクトリをパスに追加 )
##############################################################################
export PATH="$PATH:$(du "$HOME/.scripts/" | cut -f2 | tr '\n' ':' | sed 's/:*$//')"

##############################################################################
# 2022/04/25追加     Aliases (confi/aliasrcにコマンドエイリアスを作成)
##############################################################################

if [ -f ~/.config/aliasrc ]; then
    . ~/.config/aliasrc
fi

if [ -f ~/.aliasrc.private ]; then
	. ~/.config/aliasrc.private
fi

if [ -f ~/.aliasrc.work ]; then
	. ~/.config/aliasrc.work
fi

##############################################################################


